# print("안녕")
# print("반갑습니다.")
# print("저는 홍길동입니다.")
# print("잘 부탁드리겠습니다.")

# print("3 + 5 =", 3+5)
# print("3 * 5 =", 3 * 5)

### 변수 만들기

# 수 = 10
# print(수)

# import turtle

# t = turtle.Pen()
# t.forward(100)
# t.left(120)
# t.forward(100)
# t.left(120)
# t.forward(100)
# t.left(120)

# 높이 = 100
# # 너비 = 200
# # 면적 = 높이 * 너비
# # print("면적은 ", 면적, "입니다.")

# 인사 = "안녕하세요"
# print(인사)
# 원주율 = 3.141592
# print(원주율)

### 입력 배우기 ###

### int(정수형: 4, 5), float(실수형: 3.12, 10.39)
### str(문자형: "안녕") 

# print("배고파"*10)
# 수1 = int(input("수1을 입력하세요."))
# 수2 = int(input("수2을 입력하세요."))

# 합계 = 수1 + 수2
# print(합계)

# ### 초를 분초로 바꾸기 ###

# 초 = 100

# 분 = 초 // 60       # // 몫을 구하는 연산자
# 남은초 = 초 % 60    # %  나머지를 구하는 연산자
# print(분, "분", 남은초, "초")

### 돈을 가지고 살 수 있는 사탕과 남은 돈 계산하기 ###

돈 = 30000
사탕값 = 150

사탕수 = 돈 // 사탕값
# print(사탕수)
남은돈 = 돈 % 사탕값

print(사탕수, "개 사고, ", 남은돈, "원 남습니다.")





